r0n4n/provant_software_Ro/io-board/stm32f4/base/modules/io/c_io_herkulex.c
/**
  ******************************************************************************
  * @file    modules/io/c_io_herkulex.h
  * @author  Iuro Baptista Pereira Nascimento
  * @version V1.0.0
  * @date    01/12/2014
  * @brief   Implementação da Servo Herkulex DRS-0201
  *****************************************************************************/

#include "c_io_herkulex.h"

#include <math.h>
#include <stdint.h>
#include <string.h>

#include "../../../core/cmsis/inc/stm32f4xx.h"
#include "../../hal/c_common_uart.h"

/** @addtogroup Module_IO
  * @{
  */

/** @addtogroup Module_IO_Component_Herkulex
  *	\brief Componente para o uso dos servos Herkulex DRS- 0201
  *
  * @{
  */

/* Private typedef -----------------------------------------------------------*/


/* Private define ------------------------------------------------------------*/
#define SIZE_BUFFER 30

/* Private macro -------------------------------------------------------------*/


/* Private variables ---------------------------------------------------------*/
USART_TypeDef *usartx;
/* variaveis para decodificação de pacotes */
//uint8_t size;			//tamanho do pacote
//uint8_t pid;			//servo ID ou 0xFE para enviar a todos os servos.
//uint8_t cmd;			// Comando
//uint8_t csum1;			//checksum1
//uint8_t csum2;			//checksum2
//uint8_t dataAddr;		// endereço do registrador
//uint8_t dataLength;		//numero de bytes lidos
uint8_t statusError;
uint8_t statusDetail;
float position;
float velocity;
/** informa se pacotes foram recebidos e se estão inteiros
 * status =
 * 1- ok, recebido
 * 0- erro: ou o pacote nao foi recebido, ou o pacote foi corrompido.
 */
uint8_t status;/* informa se pacotes foram recebidos, */
uint8_t BUFFER[SIZE_BUFFER];		// Buffer de dados a serem enviados
uint8_t DATA[20];		// Buffer dados crus recebidos sem cabeçalho ou soma de verificação



/* Private function prototypes -----------------------------------------------*/
void c_io_herkulex_clearBuffer(void);
int16_t c_io_herkulex_getRawPosition(uint8_t data[]);
int16_t c_io_herkulex_getRawVelocity(uint8_t data[]);
float c_io_herkulex_raw2pos(int16_t rawData);
float c_io_herkulex_raw2vel(int16_t raw_data);
float c_io_herkulex_raw2pos2(uint8_t data[]);
float c_io_herkulex_raw2vel2(uint8_t data[]);
uint8_t c_io_herkulex_unpack();
uint8_t c_io_herkulex_serializeRw(uint8_t size, uint8_t pid, uint8_t cmd, uint8_t dataAddr, uint8_t dataLength);
void c_io_herkulex_serializeSjog(pv_sjog_herkulex sjog[], uint8_t numJogs, uint8_t ptime);
void c_io_herkulex_serializeIjog(pv_ijog_herkulex ijog[], uint8_t numIjogs);
void c_io_herkulex_send(void);
uint8_t c_io_herkulex_receive(void);
uint8_t c_io_herkulex_checksum1(uint8_t *buffer, uint8_t size);
uint8_t c_io_herkulex_checksum2(uint8_t cksum1);
int16_t c_io_herkulex_deg2raw(float position_deg);
pv_ijog_herkulex c_io_herkulex_createIjog(uint8_t servoId, int16_t data, uint8_t stop, uint8_t mode, uint8_t led, uint8_t ptime);
pv_sjog_herkulex c_io_herkulex_createSjog(uint8_t servoId, int16_t data, uint8_t stop, uint8_t mode, uint8_t led, uint8_t invalid);


/* Private functions ---------------------------------------------------------*/
/** \brief Torna zero os elementos do buffer de saída. */
void c_io_herkulex_clearBuffer(void)
{
	int i;

	for (i = 0; i < SIZE_BUFFER; i++)
		BUFFER[i] = 0;
}


/** \brief Pega os dois bytes da posição angular lida do buffer.
 * @param data buffer
 * @return valor dos 2 bytes em um inteiro de 16 bits.
 */
int16_t c_io_herkulex_getRawPosition(uint8_t data[])
{
	return (int16_t)(((data[1] & 0x03) << 8) | data[0]);
}

/** \brief  Pega os dois bytes da velocidade angular lida do buffer.
 *
 * @param data buffer
 * @return a velocidade angular enviada pelo servo.
 */
int16_t c_io_herkulex_getRawVelocity(uint8_t data[])
{
	return (int16_t)(((data[1] & 0xFF) << 8) | data[0]);
}


/** \brief Converte os dados enviados pelo servo para radianos.
 *
 *	@param rawData dados enviados pelo servo.
 *	@return retorna a posição em radianos.
 */
float c_io_herkulex_raw2pos(int16_t rawData)
{
	return (((float)rawData) * 0.325 - 166.65) * M_PI / 180.0;
}

/** \brief Converte os dados enviados pelo servo para radianos.
 *
 *	@param data dados enviados pelo servo.
 *	@return retorna a posição em radianos.
 */
float c_io_herkulex_raw2pos2(uint8_t data[])
{
	int8_t rawData = (int16_t)(((data[1] & 0x03) << 8) | data[0]);
	return (((float)rawData) * 0.325 - 166.65) * M_PI / 180.0;
}


/** \brief Converte os dados enviados pelo servo para rad/s.
 *
 *	@param rawData dados enviados pelo servo.
 *	@return retorna a velocidade em rad/s.
 */
float c_io_herkulex_raw2vel(int16_t raw_data)
{
	return ((float)raw_data) * 29.09 * M_PI / 180.0;
}

/** \brief Converte os dados enviados pelo servo para rad/s.
 *
 *	@param data dados enviados pelo servo.
 *	@return retorna a velocidade em rad/s.
 */
float c_io_herkulex_raw2vel2(uint8_t data[])
{
	int16_t rawData = (int16_t)(((data[1] & 0xFF) << 8) | data[0]);
	return ((float)rawData) * 29.09 * M_PI / 180.0;
}


/** \brief Retira os dados do buffer.
 *
 * @return returna 1 se o pacote não foi corrompido, 0 se foi.
 */
uint8_t c_io_herkulex_unpack()
{
	uint8_t new_cksum1, new_cksum2, dataAddr, dataLength;

	uint8_t size = (unsigned char)BUFFER[2];
	uint8_t pid = BUFFER[3];
	uint8_t cmd = BUFFER[4];
	uint8_t csum1 = BUFFER[5];
	new_cksum1 = c_io_herkulex_checksum1(BUFFER, size);
	uint8_t csum2 = BUFFER[6];
	new_cksum2 = c_io_herkulex_checksum2(new_cksum1);
	if ((new_cksum1 != csum1) || (new_cksum2 != csum2))
		return 0;

	if (size > 7) {
		if (cmd == ACK_STAT) {
			statusError = BUFFER[7];
			statusDetail = BUFFER[8];
		} else {
			dataAddr = BUFFER[7];
			dataLength = BUFFER[8];
		}
	}

	if (size > 9) {
		memcpy(DATA, BUFFER + 9, dataLength);
		statusError = BUFFER[size - 2];
		statusDetail = BUFFER[size - 1];
	}

	return 1;
}


/** \brief Coloca no buffer pacotes de leitura e escrita de registradores.
 *
 * @param size Tamanho do pacote.
 * @param pid ID do servo, ou o endereço de broadcast 0xFE.
 * @param cmd Comando a ser enviado, XXX_WRITE ou XXX_READ. XXX = EEP | RAM.
 * @param dataAddr Endereço do registrador.
 * @param dataLength Número de bytes lidos ou escritos.
 * @return retorna 0 se o buffer for inconsistente. Caso contrário, 1.
 */
uint8_t c_io_herkulex_serializeRw(uint8_t size, uint8_t pid, uint8_t cmd, uint8_t dataAddr, uint8_t dataLength)
{
	if (size <= 0)
		return 0;

