r0n4n/provant_software_Ro/io-board/stm32f4/base/modules/io/c_io_herkulex.c
	BUFFER[0] = HEADER;
	BUFFER[1] = HEADER;
	BUFFER[2] = size;
	BUFFER[3] = pid;
	BUFFER[4] = cmd;

	if (size > 7) {
		BUFFER[7] = dataAddr;
		BUFFER[8] = dataLength;
	}

	uint8_t i;

	if (size > 9) {
		for (i = 0; i < dataLength; i++)
			BUFFER[9 + i] = DATA[i];
	}


	if ((size-dataLength) > 9) {
		BUFFER[size - 2] = statusError;
		BUFFER[size - 1] = statusDetail;
	}

	BUFFER[5] = c_io_herkulex_checksum1(BUFFER, size);
	BUFFER[6] = c_io_herkulex_checksum2(BUFFER[5]);
	//csum1 = BUFFER[5];
	//csum2 = BUFFER[6];

	return 1;
}

/** \brief Coloca no buffer pacotes sjog de comandos de torque/posição.
 *
 * @param sjog[] É um array de pv_sjog_herkulex, podendo conter um ou mais elementos.
 * @param numJogs Número de elementos em sjog[].
 * @param ptime "Play time": tempo estipulado para o servo chegar a posição de destino.
 */
void c_io_herkulex_serializeSjog(pv_sjog_herkulex sjog[], uint8_t numJogs, uint8_t ptime)
{
	int n = sizeof(pv_sjog_herkulex);

	BUFFER[0] = HEADER;
	BUFFER[1] = HEADER;
	/* numero_sjogs*bytes_por_sjog+bytes_de_cabecalho */
	BUFFER[2] = numJogs * n + 8;
	if (numJogs>1)
		BUFFER[3] = 0xFE;
	else
		BUFFER[3] = sjog[0].ucID;

	BUFFER[4] = S_JOG;
	BUFFER[7] = ptime;

	memcpy((BUFFER+8), (void *) sjog, n * numJogs);

	//uint8_t csum1 = c_io_herkulex_checksum1(BUFFER, BUFFER[2]); /* por que usar csum??????? */
	//uint8_t csum2 = c_io_herkulex_checksum2(csum1);
	BUFFER[5] = c_io_herkulex_checksum1(BUFFER, BUFFER[2]);
	BUFFER[6] = c_io_herkulex_checksum2(BUFFER[5]);
}


/** \brief Coloca no buffer pacotes sjog de comandos de torque/posição.
 *
 * @param ijog[] Array de pv_ijog_herkulex, podendo conter um ou mais elementos.
 * @param numIjogs Número de elementos em sjog[].
 */
void c_io_herkulex_serializeIjog(pv_ijog_herkulex ijog[], uint8_t numIjogs)
{
	int n = sizeof(pv_ijog_herkulex);

	BUFFER[0] = HEADER;
	BUFFER[1] = HEADER;
	/* numero_sjogs * bytes_por_sjog + bytes_de_cabecalho */
	BUFFER[2] = numIjogs * n + 7;
	if (numIjogs>1)
		BUFFER[3] = 0xFE;
	else
		BUFFER[3] = ijog[0].ucID;

	BUFFER[4] = I_JOG;

	memcpy((BUFFER + 7), (void *) ijog, n * numIjogs);

	/* csum1=checksum1(BUFFER,BUFFER[2]); /* por que usar csum??????? */
	/* csum2=checksum2(csum1); */
	BUFFER[5] = c_io_herkulex_checksum1(BUFFER, BUFFER[2]);
	BUFFER[6] = c_io_herkulex_checksum2(BUFFER[5]);
}

/** \brief Envia os dados do buffer. */
void c_io_herkulex_send(void)
{
	int i;

	for (i = 0; i < BUFFER[2] ; ++i)
		c_common_usart_putchar(usartx, BUFFER[i]);
}

/** \brief Recebe um pacote de dados do servo.
 *
 * @return Booleano que indica se o pacote foi recebido intacto.
 */
uint8_t c_io_herkulex_receive(void)
{
	int i = 0;
	uint8_t lastByte = 0, inByte = 0, ok = 0, size = 30;
	unsigned long last_now = 0, now = 0, timeOut;

	last_now = now;
	now = c_common_utils_millis();
	timeOut = 3 + now;
	//TODO testar outro timeout
	/* timeOut = 3; while (now - last_now <= timeOut && i < size) { */
	while (now <= timeOut && i < size) {
		while (!c_common_usart_available(usartx) && now <= timeOut)
			now = c_common_utils_millis();
		lastByte = inByte;
		inByte = c_common_usart_read(usartx);
		if (!ok && inByte == 0xFF && lastByte == 0xFF) {
			BUFFER[0] = 0xFF;
			i = 1;
			ok = 1;
		}
		if (ok) {
			BUFFER[i] = inByte;
			if (i == 2)
				size = BUFFER[2];
			i++;
		}
	}
	if (now >= timeOut)
		return 0;
	return 1;
}

/** \brief Faz a primeira soma de verificação dos pacotes.
 *
 * @param buffer Buffer utilizado.
 * @param size Tamanho do buffer em bytes.
 * @return A soma de verificação.
 */
uint8_t c_io_herkulex_checksum1(uint8_t *buffer, uint8_t size)
{
	uint8_t i;
	char chksum = 0;

	for (i = 2; i < 5; i++)
		chksum = chksum ^ buffer[i];

	for (i = 7; i < size; i++)
		chksum = chksum ^ buffer[i];

	return chksum & 0xFE;
}

/** \brief Segunda soma de verificação.
 *
 * @param checksum1 A primeira soma de verificação.
 * @return A segunda soma de verificação.
 */
uint8_t c_io_herkulex_checksum2(uint8_t checksum1)
{
	return (~checksum1) & 0xFE;
}

/** \brief Converte uma posição de graus para inteiro de 16 bits.
 *
 *	O servo DRS0201 entende somente o dado conertido para inteiro de 16 bits.
 *
 * @param position_deg Posição em graus.
 * @return Posição em inteiro de 16 bits.
 */
int16_t c_io_herkulex_deg2raw(float position_deg)
{
	return ((int16_t)(position_deg / 0.325 + 0.5)) + 512; /* 0.5 -> round */
}

/** \brief Cria uma struct pv_ijog_herkulex.
 *
 * @param servoId ID do servo.
 * @param data PWM ou posição desejada. Até +/- 1023.
 * @param stop bit de parada do servo:
 * 					-1 para o servo;
 * 					-0 para outros comandos.
 * @param mode modo de operação:
 * 							-ROTATION_MODE: modo de rotação contínua;
 * 							-POSITION_MODE: modo de posição.
 * @param led Indica quais leds deveram estar acessos e apagados.
 * 				Usar as constantes LED_GREEN, LED_BLUE e LED_RED
 *
 * @param ptime Play time. É o tempo em que o servo deve chega a posição de destino.
 * @return A estrutura pv_ijog_herkulex com os parametros desejados.
 */
pv_ijog_herkulex c_io_herkulex_createIjog(uint8_t servoId, int16_t data,
		uint8_t stop, uint8_t mode, uint8_t led, uint8_t ptime)
{
	pv_ijog_herkulex ijog;

	ijog.iJogData = data;
	ijog.uiStop = stop;
	ijog.uiMode = mode;
	ijog.uiLed = led;
	ijog.ucID = servoId;
	ijog.uiReserved1 = 0;
	ijog.uiJogInvalid = 0;
	ijog.uiReserved2 = 0;
	ijog.ucJogTime_ms = ptime;


	return ijog;
}


/** \brief Cria uma struct pv_sjog_herkulex.
 *
 * @param servoId ID do servo.
 * @param data PWM ou posição desejada. Até +/- 1023.
 * @param stop bit de parada do servo:
 * 					-1 para o servo;
 * 					-0 para outros comandos.
 * @param mode modo de operação:
 * 							-ROTATION_MODE: modo de rotação contínua;
 * 							-POSITION_MODE: modo de posição.
 * @param led Indica quais leds deveram estar acessos e apagados.
 * 				Usar as constantes LED_GREEN, LED_BLUE e LED_RED
 *
 * @param invalid Indica que o sjog é inválido.
 * @return A estrutura pv_sjog_herkulex com os parametros desejados.
 */
pv_sjog_herkulex c_io_herkulex_createSjog(uint8_t servoId, int16_t data,
		uint8_t stop, uint8_t mode, uint8_t led, uint8_t invalid)
{
	pv_sjog_herkulex sjog;

	sjog.iJogData = data;
	sjog.uiStop = stop;
	sjog.uiMode = mode;
	sjog.uiLed = led;
	sjog.ucID = servoId;
	sjog.uiReserved1 = 0;
	sjog.uiJogInvalid = invalid;
	sjog.uiReserved2 = 0;

