r0n4n/provant_software_Ro/io-board/stm32f4/base/modules/io/c_io_herkulex.c
	return sjog;
}



/* Exported functions definitions --------------------------------------------*/

/* Direct servo commands */
/** \brief Lê o valor dado um endereço de memoria.
  * Retorna o valor em caso de sucesso.
  *
  * @param mem tipo de memória, ROM ou RAM
  * @param  servo_id ID do servo.
  * @param reg_addr Endereço do registrador do servo
  * @param data_length Tamanho dos dados a serem escritos
  * @return ponteiro para os dados lidos.
  */
uint8_t  c_io_herkulex_read(char mem, char servo_id, char reg_addr,
	unsigned char datalength)
{
	uint8_t size = 9;
	uint8_t cmd;

	if (mem == EEP)
		cmd = EEP_READ;
	else
		cmd = RAM_READ;

	c_io_herkulex_serializeRw(size, servo_id, cmd, reg_addr, datalength);
	c_io_herkulex_send();
	c_io_herkulex_clearBuffer();
	status = c_io_herkulex_receive();
	if (status) /* se for corrompido, faz status = 0 */
		status = c_io_herkulex_unpack(BUFFER);

	return status;
}

/** \brief Escreve o valor dado um endereço de memoria, entre 0 e 0x18.
  * Retorna o valor em caso de sucesso.
  *
  * @param mem tipo de memória, ROM ou RAM
  * @param  servoId ID do servo.
  * @param reg_addr Endereço do registrador do servo
  * @param data_length Tamanho dos dados a serem escritos
  * @param data Ponteiro para os dados a serem escritos
  * @return bool - 1 se dados foram enviados, 0 se não foram.
  */
uint8_t c_io_herkulex_write(char mem, char servoId, char reg_addr,
	unsigned char datalength, char *data)
{
	uint8_t pid = servoId;
	uint8_t size = 0x09 + datalength;
	uint8_t cmd;

	if (mem == EEP)
		cmd = EEP_WRITE;
	else
		cmd = RAM_WRITE;

	if (data != NULL) {
		memcpy(DATA, data, datalength);
		c_io_herkulex_serializeRw(size,servoId,cmd,reg_addr,datalength);
		c_io_herkulex_send();
		return 1;
	} else {
		return 0;
	}
}



/** \brief Envia um comando ijog.
 *
 * \details Um comando ijog pode ser enviado a vários servos ao mesmo tempo,
 * com 'play time' diferentes
 *
 * @param ijog[] Array de um ou mais pv_ijog_herkulex.
 * @param numIjog Número de estruturas ijog no array ijog[].
 */
void c_io_herkulex_sendIjog(pv_ijog_herkulex ijog[], uint8_t numIjog)
{
	c_io_herkulex_serializeIjog(ijog, numIjog);
	c_io_herkulex_send();
}

/** \brief Envia um comando sjog.
 *
 * \details Um comando sjog pode ser enviado a vários servos ao mesmo tempo,
 * usando 'play time' iguais.
 *
 * @param sjog
 * @param num_servos
 * @param ptime
 */
void c_io_herkulex_sendSjog(pv_sjog_herkulex sjog[], uint8_t num_servos,
	uint8_t ptime)
{
	c_io_herkulex_serializeSjog(sjog, num_servos, ptime);
	c_io_herkulex_send();
}

/** \brief Envia um comando de pedido de status ao servo.
 *
 * @param servoId ID do servo.
 * @return Booleano que confirma ou não o recebimento do status.
 */
uint8_t c_io_herkulex_readStatus(uint8_t servoId)
{
	c_io_herkulex_serializeRw(7,servoId,STAT,0,0);
	c_io_herkulex_send();

	return c_io_herkulex_receive();
}


/** \brief Reinicia o servo.
 *
 * @param servoId ID do servo.
 */
void c_io_herkulex_reboot(uint8_t servoId)
{
	c_io_herkulex_serializeRw(7,servoId,REBOOT,0,0);
	c_io_herkulex_send();
}




/* Indirect commands */
/** \brief Inicializa o usart para comunicacao serial entre servo e discovery
 *
 * @param usartn USART a ser usada.
 * @param baudrate Baud rate da comunicação serial.
 */
void c_io_herkulex_init(USART_TypeDef *usartn, int baudrate)
{
	usartx = usartn;
	/* Inicia a usart2 */
	if (usartx == USART1)
		c_common_usart1_init(baudrate);
	else if (usartx == USART2)
		c_common_usart2_init(baudrate);
	else if (usartx == USART3)
		c_common_usart3_init(baudrate);
	else if (usartx == USART6)
		c_common_usart6_init(baudrate);
}

/** Configuração inicial do servo.
 *
 * @param servoId ID do servo.
 */
void c_io_herkulex_config(uint8_t servoId)
{
	c_io_herkulex_clear(servoId);
	//c_io_herkulex_reboot(servoId);
	c_common_utils_delayms(500);

	/* only reply to read commands */
	c_io_herkulex_configAckPolicy(servoId, 1);

	/* Acceleration Ratio = 0 */
	DATA[0] = 0;
	c_io_herkulex_write(RAM, servoId, REG_ACC_RATIO, 1, DATA);

	/* set no acceleration time */
	DATA[0] = 0;
	c_io_herkulex_write(RAM, servoId, REG_MAX_ACC_TIME, 1, DATA);

	/* zera o offset de pwm */
	DATA[0] = 0;
	c_io_herkulex_write(RAM, servoId, REG_PWM_OFFSET, 1, DATA);

	/* min pwm = 0 */
	DATA[0] = 0;
	c_io_herkulex_write(RAM, servoId, REG_MIN_PWM, 1, DATA);

	/* max pwm >1023 -> no max pwm */
	DATA[1] = 0x03;//little endian 0x03FF sent
	DATA[0] = 0xFF;
	c_io_herkulex_write(RAM, servoId, REG_MAX_PWM, 2, DATA);

	/** set overload pwm register, if overload_pwm>1023, overload is never
	 * activated this is good for data acquisition, but may not be the case for
	 * the tilt-rotor actualy flying.
	 */
	DATA[0] = 0xFF;
	DATA[1] = 0x03;//little endian, 2048 sent
	c_io_herkulex_write(RAM, servoId, REG_OVERLOAD_PWM_THRESHOLD, 2, DATA);

	/** configura Kp, ki,kd and 1st and 2nd feedforward gains
	uint8_t i, n=10;// n is the number of bytes to written
	for(i=0;i<n;i++) {
		DATA[i]=0;
	c_io_herkulex_write(RAM,servo1_id,REG_KP,n,DATA);
	*/

	c_io_herkulex_setTorqueControl(servoId, TORQUE_ON);
	c_io_herkulex_clear(servoId);
}

/** \brief Configura a politica de respostas do servo.
 *
 * @param servoId ID do servo.
 * @param policy
 * 				-0: Nenhuma resposta;
 * 				-1: resposta somente a comandos de leitura.
 * 				-2: resposta a todos os comandos.
 * 	O comando stat sempre recebe resposta.
 */
void c_io_herkulex_configAckPolicy(char servoId, char policy)
{
	DATA[0] = policy;
	c_io_herkulex_write(RAM, servoId, REG_ACK_POLICY, 1, DATA);
}

/** \brief Configura a poítica de acendimento de leds de alarme.
 *
 * @param servoId ID do servo.
 * @param policy Se '1' os leds piscarão em vermelho quando houver um erro.
 * 				 Se '0', os leds não piscarão quando houver um erro no servo.
 */
void c_io_herkulex_configLedPolicy(char servoId, char policy)
{
	DATA[0] = policy;
	c_io_herkulex_write(RAM, servoId, REG_ACK_POLICY, 1, DATA);
}

/** \brief Função de acendimento dos leds.
 *
 * @param servoId ID do servo.
 * @param led Combinação OR de LED_GREEN, LED_BLUE e LED_RED.
 */
void c_io_herkulex_ledControl(char servoId, char led)
{
	DATA[0] = led;
	c_io_herkulex_write(RAM, servoId, REG_LED_CONTROL, 1, DATA);
}

/** \brief Limpa os erros do servo, e apaga os leds de alarme.
 *
 * @param servoId ID do servo.
 */
void c_io_herkulex_clear(uint8_t servoId)
{
	DATA[0] = 0;
	DATA[1] = 0;
	c_io_herkulex_write(RAM, servoId, REG_STATUS_ERROR, 2, DATA);
}

/** \brief Configura o status do torque.
 *
 * @param servoId ID do servo.
 * @param control
 * 					-TORQUE_FREE: torque desligado, mas o eixo é livre para se
 * 						mover.
 * 				  	-TORQUE_BREAK: Torque desligado, mas o eixo fica travado.
 * 				  	-TORQUE_ON: Liga o torque. O torque deve ser ligado tanto
 * 				  		para os modos de rotação contínua e de posição.
 */
void c_io_herkulex_setTorqueControl(uint8_t servo_id, uint8_t control)
{
	DATA[0] = control;
	c_io_herkulex_write(RAM, servo_id, REG_TORQUE_CONTROL, 1, DATA);
}

/** \brief Configura o baudrate do servo.
 *
 * \details É necessário reiniciar o servo para que o baudrate mude.
 *
 * @param servoId ID do servo.
 * @param baudrate Baud rate. O servo só aceita alguns valores, como pode ser
 * 					verificado no 'switch'.
 */
void c_io_herkulex_setBaudRate(uint8_t servoId, int baudrate)
{
	switch (baudrate) {
	case 57600:
		baudrate = 0x22;
		break;
	case 115200:
		baudrate = 0x10;
		break;
	case 200000:
		baudrate = 0x09;
		break;
	case 250000:
		baudrate = 0x07;
		break;
	case 400000:
		baudrate = 0x04;
		break;
	case 500000:
		baudrate = 0x03;
		break;
	case 666666:
		baudrate = 0x02;
		break;
	default:
		baudrate = -1;
	}
	if (baudrate > 0) {
		DATA[0] = baudrate;
		c_io_herkulex_write(EEP, servoId, EEP_BAUD_RATE, 1, DATA);
	}
}



/** Interface de Controle */
/** \brief Le a posição do servo.
 *
 * \details Envia um comando de leitura e espera a resposta do servo.
 *
 * @param servoId Id do servo.
 * @return Booleano que indica se a leitura ocorreu com sucesso.
 */
int8_t c_io_herkulex_readPosition(uint8_t servoId)
{
	if (!c_io_herkulex_read(RAM, servoId, REG_ABSOLUTE_POS, 2))
		return 0;

