r0n4n/provant_software_Ro/io-board/stm32f4/base/modules/io/c_io_herkulex.c
	int16_t rawValue = c_io_herkulex_getRawPosition(DATA);
	position = c_io_herkulex_raw2pos(rawValue);

	return 1;
}

/** \brief Le a velocidade angular.
 *
 * \details Envia um comando de leitura da velocidade angular e espera a
 * 			resposta do servo.
 *
 * @param servo_id Id do servo.
 * @return Booleano que indica se a leitura ocorreu com sucesso.
 */
int8_t c_io_herkulex_readVelocity(uint8_t servoId)
{
	if (!c_io_herkulex_read(RAM, servoId, REG_DIFFERENTIAL_POS, 2))
		return 0;

	velocity = c_io_herkulex_raw2vel2(DATA);

	return 1;
}

/** \brief Le velocidade angular e posição do servo.
 *
 * @param servoId Id do servo.
 * @return booleano que indica se a leitura ocorreu com sucesso.
 */
int8_t c_io_herkulex_readData(uint8_t servo_id)
{
	if (!c_io_herkulex_read(RAM, servo_id, REG_ABSOLUTE_POS, 4))
			return 0;

	position = c_io_herkulex_raw2pos2(DATA);
	velocity = c_io_herkulex_raw2vel2(DATA + 2);

	return 1;
}
/** \brief retorna a ultima posição lida por c_io_herkulex_read{Position,Data} */
float c_io_herkulex_getPosition(uint8_t servo_id)
{
	return position;
}

/** \brief retorna a ultima velocidade lida por c_io_herkulex_read{Velocity,Data} */
float c_io_herkulex_getVelocity(uint8_t servo_id)
{
	return velocity;
}

/** \brief Envia um comando de torque.
 *
 * @param servoId
 * @param pwm Valor de PWM do torque entre -1023 e 1023
 */
void c_io_herkulex_setTorque(uint8_t servoId, int16_t pwm)
{
	int8_t sign = 0;

	if (pwm < 0) {
		pwm = pwm * -1;
		sign = 1;
	}
	if (pwm > 1023)
		pwm = 1023;

	pwm |= sign << 14;
	pv_sjog_herkulex sjog =  c_io_herkulex_createSjog(servoId, pwm, 0,
			ROTATION_MODE, 0, 0);
	c_io_herkulex_sendSjog(&sjog, 1, 0);
}

/** Envia 1 comando de torque a 2 servos.
 *
 * @param servo1_id ID do servo 1.
 * @param pwm1 torque do servo 1, em PWM entre -1023 e 1023.
 * @param servo2_id ID do servo 2.
 * @param pwm2 torque do servo 2, em PWM entre -1023 e 1023.
 */
void c_io_herkulex_setTorque2Servos(uint8_t servo1_id, int16_t pwm1,
	uint8_t servo2_id, int16_t pwm2)
{
	int8_t sign1 = 0, sign2 = 0;

	if (pwm1 < 0) {
		pwm1 = pwm1 * -1;
		sign1 = 1;
	}
	if (pwm1 > 1023)
		pwm1 = 1023;

	if (pwm2 < 0) {
		pwm2 = pwm2 * -1;
		sign1 = 1;
	}
	if (pwm2 > 1023)
		pwm2 = 1023;

	pwm1 |= sign1 << 14;
	pv_sjog_herkulex sjog[2];

	sjog[0] = c_io_herkulex_createSjog(servo1_id, pwm1, 0, ROTATION_MODE,
		0, 0);

	pwm2 |= sign2 << 14;
	sjog[1] =  c_io_herkulex_createSjog(servo2_id, pwm2, 0, ROTATION_MODE,
		0, 0);
	c_io_herkulex_sendSjog(sjog, 2, 0);
}

/** \brief Muda a referência de posição.
 *
 * @param servoId ID do servo.
 * @param position posição de referência em radianos.
 */
void c_io_herkulex_setPosition(uint8_t servoId, float position)
{
	int16_t rawPos = c_io_herkulex_deg2raw(rad2deg(position));
	pv_sjog_herkulex sjog = c_io_herkulex_createSjog(servoId, rawPos, 0,
			POSITION_MODE, 0, 0);
	c_io_herkulex_sendSjog(&sjog, 1, 0);
}

/** \brief Muda a referência de posição.
 *
 * @param servoId ID do servo.
 * @param position posição de referência em radianos.
 */
void c_io_herkulex_setPosition2Servos(uint8_t servo1_id, float pos1,
		uint8_t servo2_id, float pos2)
{
	int16_t raw_pos1 = c_io_herkulex_deg2raw(rad2deg(pos1));
	int16_t raw_pos2 = c_io_herkulex_deg2raw(rad2deg(pos2));
	pv_sjog_herkulex sjog[2];

	sjog[0] = c_io_herkulex_createSjog(servo1_id, raw_pos1, 0,
		POSITION_MODE, 0, 0);
	sjog[1] = c_io_herkulex_createSjog(servo2_id, raw_pos2, 0,
		POSITION_MODE, 0, 0);
	c_io_herkulex_sendSjog(sjog, 2, 0);
}

/** \brief Retorna o código do 'status error'. */
uint8_t c_io_herkulex_getStatusError(void)
{
	return statusError;
}

/** \brief Retorna o código do 'status detail'. */
uint8_t c_io_herkulex_getStatusDetail(void)
{
	return statusDetail;
}

/** \brief Retorna o status do servo. */
uint8_t c_io_herkulex_getStatus(void)
{
	return status;
}

/** Auxiliary functions */
/** \brief Transforma o código de erro em string.
 *
 * @param dest String de retorno do resultado.
 * @param status_error Código de erro.
 * @param status_detail Código de erro detalhado.
 */
void c_io_herkulex_decodeError(char *dest, int8_t status_error, int8_t status_detail)
{
	int n;

	dest[0] = 0;
	if (status_error & 0x01)
		strcat(dest, "Exceed input voltage limit, ");

	if (status_error & 0x02)
		strcat(dest, "Exceed alowed POT limit, ");

	if (status_error & 0x04)
		strcat(dest, "Exceed temperature limit, ");

	if (status_error & 0x08) {
		strcat(dest, "Invalid packet: ");
		if (status_detail & 0x04)
			strcat(dest, "Checksum Error, ");
		if (status_detail & 0x08)
			strcat(dest, "Unknown Command, ");
		if (status_detail & 0x10)
			strcat(dest, "Exceed REG range, ");
		if (status_detail & 0x20)
			strcat(dest, "Garbage detected, ");
	}
	if (status_error & 0x10)
		strcat(dest, "Overload detected, ");

	if (status_error & 0x20)
		strcat(dest, "Driver fault detected, ");

	if (status_error & 0x40)
		strcat(dest, "EEP reg distorted, ");

	n = strlen(dest);

	dest[n - 2] = 0;
}

/* @}
 * @}
 */
